fedetft/miosix-kernel/miosix/arch/common/drivers/stm32f1_f2_f4_serial.cpp
void STM32DmaSerial::IRQhandleDmaTxInterrupt()
{
    port->getDma().IRQhandleDmaTxInterrupt();
    dmaTxInProgress=false;
    if(txWaiting==nullptr) return;
    txWaiting->IRQwakeup();
    txWaiting=nullptr;
}

void STM32DmaSerial::waitDmaWriteEnd()
{
    FastGlobalIrqLock dLock;
    // If a previous DMA xfer is in progress, wait
    if(dmaTxInProgress)
    {
        txWaiting=Thread::IRQgetCurrentThread();
        do Thread::IRQglobalIrqUnlockAndWait(dLock); while(txWaiting);
    }
}

ssize_t STM32DmaSerial::readBlock(void *buffer, size_t size, off_t where)
{
    return STM32SerialBase::readFromRxQueue(buffer, size);
}

void STM32DmaSerial::IRQstartDmaRead()
{
    port->getDma().IRQstartDmaRead(&port->get()->DR,rxBuffer,rxQueueMin);
}

int STM32DmaSerial::IRQstopDmaRead()
{
    return rxQueueMin - port->getDma().IRQstopDmaRead();
}

void STM32DmaSerial::IRQflushDmaReadBuffer()
{
    int elem=IRQstopDmaRead();
    markBufferAfterDmaRead(rxBuffer,rxQueueMin);
    for(int i=0;i<elem;i++)
        if(rxQueue.tryPut(rxBuffer[i])==false) /*fifo overflow*/;
    IRQstartDmaRead();
}

void STM32DmaSerial::IRQhandleDmaRxInterrupt()
{
    IRQflushDmaReadBuffer();
    rxUpdateIdle(0);
    rxWakeup();
}

void STM32DmaSerial::IRQhandleInterrupt()
{
    unsigned int status=port->get()->SR;
    rxUpdateIdle(status);
    if(status & USART_SR_IDLE)
    {
        (unsigned long)port->get()->DR; //clears interrupt flags
        IRQflushDmaReadBuffer();
    }
    if((status & USART_SR_IDLE) || rxQueue.size()>=rxQueueMin)
    {
        //Enough data in buffer or idle line, awake thread
        rxWakeup();
    }
}

void STM32DmaSerial::IRQwrite(const char *str)
{
    //Wait until DMA xfer ends. EN bit is cleared by hardware on transfer end
    port->getDma().IRQwaitDmaWriteStop();
    STM32SerialBase::IRQwrite(str);
}

STM32DmaSerial::~STM32DmaSerial()
{
    waitSerialTxFifoEmpty();
    {
        GlobalIrqLock dLock;
        port->get()->CR1=0;
        IRQstopDmaRead();
        auto dma=port->getDma();
        IRQunregisterIrq(dLock,dma.getTxIRQn(),&STM32DmaSerial::IRQhandleDmaTxInterrupt,this);
        IRQunregisterIrq(dLock,dma.getRxIRQn(),&STM32DmaSerial::IRQhandleDmaRxInterrupt,this);
        IRQunregisterIrq(dLock,port->getIRQn(),&STM32DmaSerial::IRQhandleInterrupt,this);
        port->IRQdisable();
    }
}

} //namespace miosix
